---
kind: enumMember
id: F:Autodesk.Revit.DB.AutomaticConnectionBehaviorType.Full
enum: Autodesk.Revit.DB.AutomaticConnectionBehaviorType
source: html/8c50192d-a4a1-1c4d-51a4-b4c1f4e8288b.htm
---
# Autodesk.Revit.DB.AutomaticConnectionBehaviorType.Full

Connector may participate in automatic connection, but at the moment it is fully connected